In [ ]:
# creating series using dictionaries
import pandas as pd

# create a dictionary
dictionary = {'Anitha': 50, 'deepika': 10, 'sangeetha': 80}

# create a series
series = pd.Series(dictionary, index=['Anitha', 'C', 'deepika', 'sangeetha'])

print(series)

Anitha       50.0
C             NaN
deepika      10.0
sangeetha    80.0
dtype: float64

In [ ]:
# creating dataframe using dictionaries and indexing
import pandas as pd

# Create a Python dictionary
data = {'Name': ['Anitha', 'Rama', 'Deepika', 'sangeetha', 'Shiva'],
        'Marks': [93, 88, 95, 75, 99],
        'City': ['banglore', 'Pune', 'Delhi', 'chennai', 'Delhi']}

# Create a Python list of Roll NOs
Roll = [101, 102, 103, 104, 105]

# Create a DataFrame from the dictionary
# and set Roll column as the index
# using DataFrame() function with index parameter
df = pd.DataFrame(data, index = Roll)
print(df)

          Name  Marks      City
101     Anitha     93  banglore
102       Rama     88      Pune
103    Deepika     95     Delhi
104  sangeetha     75   chennai
105      Shiva     99     Delhi

In [ ]:
# slicing of data from datframes
# importing pandas library
import pandas as pd

# Initializing the nested list with Data set
players = {'Name':['M.S.Dhoni', 'Sachin','V.Kholi','Shubham gill','Hardik pandya', 'Jadeja', 'Rayudu'],
            'Age':[42,40,34,36,35,45,50],
            'Weight':[75,85,65,78,87,98,68],
            'Salary':[54230,23456,99999,98765,80976,54670,10111]}

# creating a pandas dataframe
df = pd.DataFrame(players, columns=['Name', 'Age', 'Weight', 'Salary'])

# data frame before slicing
print(df)
# slicing
df1 = df.iloc[0:4]
print(df1)
# Slicing columnss in data frame
df2 = df.iloc[:, 0:2]
print(df2)

            Name  Age  Weight  Salary
0      M.S.Dhoni   42      75   54230
1         Sachin   40      85   23456
2        V.Kholi   34      65   99999
3   Shubham gill   36      78   98765
4  Hardik pandya   35      87   80976
5         Jadeja   45      98   54670
6         Rayudu   50      68   10111
           Name  Age  Weight  Salary
0     M.S.Dhoni   42      75   54230
1        Sachin   40      85   23456
2       V.Kholi   34      65   99999
3  Shubham gill   36      78   98765
            Name  Age
0      M.S.Dhoni   42
1         Sachin   40
2        V.Kholi   34
3   Shubham gill   36
4  Hardik pandya   35
5         Jadeja   45
6         Rayudu   50

In [ ]:
#Filtering of data from dataframe
import pandas as pd

# Initializing the nested list with Data set
players = {'Name':['M.S.Dhoni', 'Sachin','V.Kholi','Shubham gill','Hardik pandya', 'Jadeja', 'Rayudu'],
            'Age':[42,50,34,36,35,45,47],
            'Weight':[75,85,65,78,87,98,68],
            'Salary':[54230,23456,99999,98765,80976,54670,10111]}

# creating a pandas dataframe
df = pd.DataFrame(players, columns=['Name', 'Age', 'Weight', 'Salary'])
filtered_df = df[df['Age'] > 45]
print(filtered_df)

     Name  Age  Weight  Salary
1  Sachin   50      85   23456
6  Rayudu   47      68   10111

In [ ]:
#Modifing data
import pandas as pd

# Initializing the nested list with Data set
players = {'Name':['M.S.Dhoni', 'Sachin','V.Kholi','Shubham gill','Hardik pandya', 'Jadeja', 'Rayudu'],
            'Age':[42,50,34,36,35,45,47],
            'Weight':[75,85,65,78,87,98,68],
            'Salary':[54230,23456,99999,98765,80976,54670,10111]}

# creating a pandas dataframe
df = pd.DataFrame(players, columns=['Name', 'Age', 'Weight', 'Salary'])
grouped_df = df.groupby('Name').agg({'Age': 'mean'})
print(grouped_df)

            Name  Age  Weight  Salary
0      M.S.Dhoni   42      75  104230
1         Sachin   50      85   73456
2        V.Kholi   34      65  149999
3   Shubham gill   36      78  148765
4  Hardik pandya   35      87  130976
5         Jadeja   45      98  104670
6         Rayudu   47      68   60111
                Age
Name
Hardik pandya  35.0
Jadeja         45.0
M.S.Dhoni      42.0
Rayudu         47.0
Sachin         50.0
Shubham gill   36.0
V.Kholi        34.0

In [ ]:
# merging data
import pandas as pd

# Initializing the nested list with Data set
players = {'Name':['M.S.Dhoni', 'Sachin','V.Kholi','Shubham gill','Hardik pandya', 'Jadeja', 'Rayudu'],
            'Age':[42,50,34,36,35,45,47],
            'Weight':[75,85,65,78,87,98,68],
            'Salary':[54230,23456,99999,98765,80976,54670,10111]}

# creating a pandas dataframe
df = pd.DataFrame(players, columns=['Name', 'Age', 'Weight', 'Salary'])
print(df)
import pandas as pd

# Initializing the nested list with Data set
wifes = {'Name':['Sakshi', 'Anjali','Anushka','Sara','Natasha', 'Raviba', 'vidya'],
            'Age':[34,55,35,25,35,38,27],
            'Weight':[65,75,55,48,50,58,68],
            'Salary':[54230,23456,99999,98765,80976,54670,10111]}

# creating a pandas dataframe
df1 = pd.DataFrame(players, columns=['Name', 'Age', 'Weight', 'Salary'])
df2 = pd.DataFrame(wifes, columns=['Name', 'Age', 'Weight', 'Salary'])
pd.merge(df1, df2, on='Age')
print(pd.concat([df1, df2]))

            Name  Age  Weight  Salary
0      M.S.Dhoni   42      75   54230
1         Sachin   50      85   23456
2        V.Kholi   34      65   99999
3   Shubham gill   36      78   98765
4  Hardik pandya   35      87   80976
5         Jadeja   45      98   54670
6         Rayudu   47      68   10111
            Name  Age  Weight  Salary
0      M.S.Dhoni   42      75   54230
1         Sachin   50      85   23456
2        V.Kholi   34      65   99999
3   Shubham gill   36      78   98765
4  Hardik pandya   35      87   80976
5         Jadeja   45      98   54670
6         Rayudu   47      68   10111
0         Sakshi   34      65   54230
1         Anjali   55      75   23456
2        Anushka   35      55   99999
3           Sara   25      48   98765
4        Natasha   35      50   80976
5         Raviba   38      58   54670
6          vidya   27      68   10111

In [ ]:
#Grouping using aggertion function
import pandas as pd

# Initializing the nested list with Data set
players = {'Name':['M.S.Dhoni', 'Sachin','V.Kholi','Shubham gill','Hardik pandya', 'Jadeja', 'Rayudu','Sakshi', 'Anjali','Anushka','Sara','Natasha', 'Raviba', 'vidya'],
            'Age':[42,50,34,36,35,45,47,34,55,35,25,35,38,27],
            'Weight':[75,85,65,78,87,98,68,65,75,55,48,50,58,68],
            'Salary':[54230,23456,99999,98765,80976,54670,10111,54230,23456,99999,98765,80976,54670,10111],
            'Gender':['Male','Male','Male','Male','Male','Male','Male','Female','Female','Female','Female','Female','Female','Female',]
           }

# creating a pandas dataframe
df = pd.DataFrame(players, columns=['Name', 'Age', 'Weight', 'Salary','Gender'])
print(df)
grouped_df = df.groupby('Gender').agg({'Age': 'mean'})
print(grouped_df)

             Name  Age  Weight  Salary  Gender
0       M.S.Dhoni   42      75   54230    Male
1          Sachin   50      85   23456    Male
2         V.Kholi   34      65   99999    Male
3    Shubham gill   36      78   98765    Male
4   Hardik pandya   35      87   80976    Male
5          Jadeja   45      98   54670    Male
6          Rayudu   47      68   10111    Male
7          Sakshi   34      65   54230  Female
8          Anjali   55      75   23456  Female
9         Anushka   35      55   99999  Female
10           Sara   25      48   98765  Female
11        Natasha   35      50   80976  Female
12         Raviba   38      58   54670  Female
13          vidya   27      68   10111  Female
              Age
Gender
Female  35.571429
Male    41.285714

In [ ]:
#Handling Missing Data in Pandas



import pandas as pd

import numpy as np

df = pd.DataFrame.from_dict({

    'Name': ['Ramcharan', 'NTR', 'Alluarjun', 'Prabhas', np.NaN],

    'Age': [33, 32, 40, 57, np.NaN],

    'Location': ['Hyderabad', 'chennai', 'New York', np.NaN, np.NaN]

})

print(df)

print(df.isnull())
print(df.isnull().sum())
df = df.fillna('NA')

print(df)

        Name   Age   Location
0  Ramcharan  33.0  Hyderabad
1        NTR  32.0    chennai
2  Alluarjun  40.0   New York
3    Prabhas  57.0        NaN
4        NaN   NaN        NaN
    Name    Age  Location
0  False  False     False
1  False  False     False
2  False  False     False
3  False  False      True
4   True   True      True
Name        1
Age         1
Location    2
dtype: int64
        Name   Age   Location
0  Ramcharan  33.0  Hyderabad
1        NTR  32.0    chennai
2  Alluarjun  40.0   New York
3    Prabhas  57.0         NA
4         NA    NA         NA

In [ ]:
#handling duplicates
import pandas as pd

df = pd.DataFrame.from_dict({

    'Name': ['Ntr', 'Karthik', 'ramcharan', 'alluarjun', 'Ntr', 'vijay'],

    'Age': [33, 32, 40, 57, 33, 32],

    'Location': ['Toronto', 'London', 'New York', 'Atlanta', 'Toronto', 'Paris'],

    'Date Modified': ['2022-01-01', '2022-02-24', '2022-08-12', '2022-09-12', '2022-01-01', '2022-12-09']

})




print(df)
print(df.duplicated())

print(df.duplicated().sum())

        Name  Age  Location Date Modified
0        Ntr   33   Toronto    2022-01-01
1    Karthik   32    London    2022-02-24
2  ramcharan   40  New York    2022-08-12
3  alluarjun   57   Atlanta    2022-09-12
4        Ntr   33   Toronto    2022-01-01
5      vijay   32     Paris    2022-12-09
0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool
1